{ 
    "url" : "perfect-day", 
    "isRtl" : false, 
    "hiddenFields" : [

    ], 
    "steps" : [
        {
            "title" : "Background", 
            "description" : "I bet you never designed your perfect day, did you?\n\nIt's extremely rare I meet someone who'll take me up on that bet.\n\nIt's crazy most people will live and die without once entertaining this thought. We all wish for a better life but no one stops to design it, and surprisingly enough it doesn't happen.\n\nI find that when you don't plan for feeling fantastic, you don't!\n\nIt's that simple.\n\nSome people tell me it completely shattered what they thought they wanted. For some it was an inspiration to press forward with current events to achieve it (but I'm sure you never procrascinate ...)\n\nNow think about your perfect day. Not what you think is possible, or realistic, but your IDEAL routine day and ...\n\nBe specific!\n\nGut out the details, like me:\n\n\"I wake up by the sun caressing my face and make love to the person next to me. Pet the dog that came into the hut.\n\nStep outside, greet some new comers, say hello to some who live around, and run but naked to the freezing beach.\n\nAfter I dry I practice some new skills, some on my own and mostly with others.\n\nThen I teach something to a crowd of 20-50 people.\"\n\nYou get the idea yes?\n\nDon't gimmie none of that \"I'm a CEO of a big company with 2 kids in a nice house\" crap.\n\nHalf assing in this case is worse than not doing it at all.\n\nIf you gonna do something, DO IT, or don't bother.\n\nNow let's begin.", 
            "notes" : "", 
            "type" : "radio", 
            "inputPlaceholder" : "", 
            "answers" : [
                {
                    "isOther" : false, 
                    "text" : "Let's do this!", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }, 
                {
                    "isOther" : false, 
                    "text" : "hmmm I never thought about this ...", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }, 
                {
                    "isOther" : false, 
                    "text" : "so what's the first step Adam?", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }
            ]
        }, 
        {
            "title" : "Puke it!", 
            "description" : "${echo}\n\nFirst \"puke\" on the screen EVERYTHING that comes to mind, in no specific order, regardless for how senseless it is.\n\nPLEASE LISTEN TO ME HERE!\n\nBrainstorming and organizing information are two different processes that occur in two differnet places in that grey blub between your ears.\n\nDO NOT DO THEM AT THE SAME TIME.\n\nKapish? Comprende?\n\nGood.\n\nNow that we are still friends, start spilling!", 
            "notes" : "", 
            "type" : "long", 
            "inputPlaceholder" : "", 
            "answers" : [

            ]
        }, 
        {
            "title" : "Adding more details", 
            "description" : "Good, now as you read what you've written:\n\n${echo}\n\nNotice what else comes to your mind now, regarding this perfect day of yours.\n\nConsider the following to juice up your thinking and add more details:\n\n- Where you live (geographically, environment, the house itself)\n- Which people/animals are around\n- What do you eat and when\n- Climate\n- What do you learn\n- What do you do", 
            "notes" : "", 
            "type" : "long", 
            "inputPlaceholder" : "", 
            "answers" : [

            ]
        }, 
        {
            "title" : "The big takeaway", 
            "description" : "Glad you've made it up to here :)\n\nNow here's the most important part ...\n\nThis is not your PERFECT day. Not your IDEAL day. Not your UTOPIAN day.\n\nThese are illusions.\n\nThere's no \"perfect\" anything, only the best we can do up to now.\n\nEverything is evolving and the only constant is change. Each time I run through this, I change it up a bit.\n\nI will never live my \"perfect\" day because the faster I evolve, that faster I can make it better in my mind, so it will always be a few steps ahead of us.\n\nMakes sense?\n\nThat's a GOOD THING!\n\nMany like to utter cliches like \"it's not about the destination, it's about the journey\", but few bring it down to practical ACTIONABLE meaningful steps..\n\nEach time you will do this it will morph a bit. Your life is an ever growing EMERGING process.\n\nJust like I keep updating the tools and methods I share, so should you keep improving every little thing in your life, as well as the big things.", 
            "notes" : "", 
            "type" : "radio", 
            "inputPlaceholder" : "", 
            "answers" : [
                {
                    "isOther" : false, 
                    "text" : "That's a good point", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }, 
                {
                    "isOther" : false, 
                    "text" : "I agree. Perfect is an illusion", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }, 
                {
                    "isOther" : false, 
                    "text" : "That's interesting ...", 
                    "isLinkNew" : false, 
                    "isConcern" : false, 
                    "concern" : ""
                }
            ]
        }
    ], 
    "credits" : "", 
    "description" : "Design your future", 
    "title" : "Perfect Day", 
    "isSavoring" : false, 
    "hasReview" : true, 
    "isDraft" : false
}

